//Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

Console.Write("Enter first number: " );
double a = Convert.ToDouble(Console.ReadLine());

Console.Write("Enter two number: ");
double b = Convert.ToDouble(Console.ReadLine());

double stepen = Math.Pow(a, b);
  {
  Console.WriteLine("Stepen numbers A from B equally: " + stepen);
  }

//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе
